# Taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "kidonng/homebrew-malt"
tap "blacktop/tap"
tap "lotyp/homebrew-formulae"

# Binaries
brew "mas"
brew "ffmpeg"
brew "mackup"
brew "tree"
brew "jq"
brew "the_silver_searcher"
brew "diff-so-fancy"
brew "lporg"
brew "lotyp/formulae/dockutil"

# Development
brew "maven"
brew "pyenv"
brew "tldr"
brew "tmux"

# Oh-my-zsh
brew "spaceship"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "alfred"
cask "anki"
cask "appcleaner"
cask "adguard"
cask "bartender"
cask "diffusionbee"
cask "dropbox"
cask "downie"
cask "imazing"
cask "istat-menus"
cask "karabiner-elements"
cask "libreoffice"
cask "macvim"
cask "maczip"
cask "mathpix-snipping-tool"
cask "network-radar"
cask "obsidian"
cask "one-switch"
cask "proxyman"
cask "permute"
cask "silicon"
cask "sublime-text"
cask "topnotch"
cask "textsniper"
cask "zerotier-one"
cask "intellij-idea"
cask "pycharm"
cask "datagrip"
cask "cloudmounter"
cask "github"
cask "iterm2"
cask "fork"
cask "openinterminal"
cask "google-chrome"
cask "apifox"
cask "switchhosts"
cask "wireshark"
cask "clashx"
cask "dash"
cask "resilio-sync"
cask "vimac"

# Quicklook
cask "qlmarkdown"
cask "quicklook-json"
cask "syntax-highlight"

# Fonts
cask "font-hack"
cask "font-roboto"
cask "font-fira-code"
